{
    "archive_access_date": "The date and time when the archive file was last accessed.",
    "archive_checksum": "The checksum or hash value of the archive file for verifying its integrity.",
    "archive_comments": "Any comments or notes related to the archive file.",
    "archive_compression_level": "The level of compression used for the archive (e.g. high, medium, low, etc.).",
    "archive_contents": "A list of the files and directories contained within the archive.",
    "archive_creation_date": "The date and time when the archive file was created.",
    "archive_creator": "The name of the individual or organization that created the archive.",
    "archive_destination": "The intended destination or use of the archive file.",
    "archive_disposal_instructions": "Instructions for how to dispose of the archive file when it is no longer needed (e.g. delete securely, transfer to another storage medium, etc.).",
    "archive_encryption": "Whether the archive is encrypted or not.",
    "archive_format": "The format of the archive file (e.g. ZIP, TAR, GZIP, RAR, etc.).",
    "archive_frequency": "The frequency with which the archive file is updated or created (e.g. daily, weekly, monthly, etc.).",
    "archive_legal_compliance": "Whether the archive file is created and maintained in compliance with legal or regulatory requirements (e.g. data protection laws, record retention regulations, etc.).",
    "archive_license": "The license under which the archive file is distributed or used.",
    "archive_metadata": "Additional metadata or descriptive information about the archive file and its contents (e.g. keywords, author, location, etc.).",
    "archive_modified_date": "The date and time when the archive file was last modified.",
    "archive_owner": "The name of the owner of the archive file.",
    "archive_password_protected": "Whether the archive is password-protected or not.",
    "archive_permissions": "The permissions set for the archive file (e.g. read-only, read-write, execute, etc.).",
    "archive_publication_date": "The date when the archive file was first published or made publicly available.",
    "archive_purpose": "A description of the intended purpose of the archive file (e.g. backup, distribution, storage, etc.).",
    "archive_related_archives": "A list of related archives or resources.",
    "archive_relevance": "The relevance or importance of the archive's contents to the organization or individual creating it.",
    "archive_restore_instructions": "Instructions for how to restore the contents of the archive file (e.g. which software to use, which files to extract, etc.).",
    "archive_retention_period": "The length of time for which the archive file should be retained.",
    "archive_scope": "The scope or extent of the archive's contents (e.g. a full system backup, a collection of related documents, etc.).",
    "archive_size": "The size of the archive file in bytes, kilobytes, megabytes, etc.",
    "archive_source": "The source or origin of the files contained within the archive.",
    "archive_use_cases": "Examples of situations in which the archive file might be used (e.g. disaster recovery, legal proceedings, etc.).",
    "archive_version": "The version number of the archive file format or software used to create it.",
    "document_page_count": "The number of pages in the document.",
    "document_related": "A list of related documents or resources.",
    "file_accessibility": "The level of accessibility of the file (e.g. public, private, restricted access, etc.).",
    "file_author": "The name of the author or creator of the file (if applicable).",
    "file_category": "The category or topic that the file content belongs to.",
    "file_category_1": "The top-level category or topic that the file content belongs to. This should not be Documents, Music, Pictures, Videos, Archives or Others, and not based on the file's mime-type",
    "file_category_2": "The second-level category or topic that the file content belongs to.",
    "file_category_3": "The third-level category or topic that the file content belongs to.",
    "file_custom_attributes": "Any additional custom attributes or metadata specific to the type of file being described.",
    "file_date_created": "The date that the file was created.",
    "file_date_modified": "The date that the file was last modified.",
    "file_description": "A brief description of the file.",
    "file_format": "The file format of the file (e.g. JPG, PNG, HTML, XML, etc.).",
    "file_id": "A 10 character descriptive unique ID for the file",
    "file_keywords": "A list of keywords or tags associated with the file.",
    "file_language": "The language of the file (if applicable).",
    "file_license": "The type of license associated with the file (e.g. Creative Commons, All rights reserved, etc.).",
    "file_related_files": "A list of related files or resources.",
    "file_short_description": "A shortest description of the file.",
    "file_size": "The file size of the file (in bytes).",
    "file_source": "The source or origin of the file (e.g. personal file, online resource, etc.).",
    "file_summary": "A brief summary or abstract of the contents of the file.",
    "file_tags": "A list of keywords or tags associated with the file.",
    "file_title": "The title of the file.",
    "movie_actors": "Who are the main actors in the movie?",
    "movie_awards": "What awards has the movie won?",
    "movie_category_1": "What is the top-level category or topic that the movie belongs to?",
    "movie_category_2": "What is the second-level category or topic that the movie belongs to?",
    "movie_category_3": "What is the third-level category or topic that the movie belongs to?",
    "movie_country": "What country was the movie produced in?",
    "movie_director": "Who directed the movie?",
    "movie_imdb_rating": "What is the IMDb rating for the movie?",
    "movie_imdb_votes": "How many IMDb votes has the movie received?",
    "movie_language": "What language is the movie in?",
    "movie_plot": "What is the plot of the movie?",
    "movie_poster": "What is the URL for the movie poster?",
    "movie_title": "What is the title of the movie?",
    "movie_type": "What type of media is the movie (e.g. movie, series, episode)?",
    "movie_year": "What year was the movie released?",
    "music_album": "The title of the album that the music track appears on (if applicable).",
    "music_album_artist": "The name of the artist or group who created the album that the music track appears on (if applicable).",
    "music_arranger": "The name of the arranger who arranged the music track (if applicable).",
    "music_artist": "The name of the artist or group who created the music.",
    "music_awards": "The awards the music track has won or been nominated for.",
    "music_bitrate": "The bitrate of the music track (in kilobits per second).",
    "music_bpm": "The tempo of the music track, measured in beats per minute (BPM).",
    "music_catalog_number": "The catalog number assigned by the record label to the music track.",
    "music_channels": "The number of audio channels in the music track (e.g. mono, stereo, etc.).",
    "music_composer": "The name of the composer who created the music track (if applicable).",
    "music_cover_art": "A URL or file path to the cover art for the music track or album.",
    "music_credits": "The credits for the music track, including any additional musicians, songwriters, or producers.",
    "music_genre": "The genre of the music track (e.g. rock, pop, hip-hop, etc.).",
    "music_guest_artist": "The name of any guest artist who performed on the music track.",
    "music_instruments": "The instruments used in the music track.",
    "music_isrc": "The International Standard Recording Code (ISRC) for the music track.",
    "music_key": "The key of the music track (e.g. C major, G minor, etc.).",
    "music_language": "The language of the lyrics in the music track (if applicable).",
    "music_length": "The length of the music track (in seconds or minutes).",
    "music_lyricist": "The name of the lyricist who wrote the lyrics for the music track (if applicable).",
    "music_mood": "The mood or feeling evoked by the music track (e.g. happy, sad, energetic, etc.).",
    "music_producer": "The name of the producer who produced the video or music track (if applicable).",
    "music_record_label": "The name of the record label that released the music track.",
    "music_release_date": "The release date of the music track or album.",
    "music_sample_rate": "The sample rate of the music track (in Hertz).",
    "music_subtitle": "Any subtitle or additional information about the music track's title.",
    "music_theme": "The central theme or message of the music track.",
    "music_track_number": "The track number of the music track on the album (if applicable).",
    "music_track_title": "The title of the music track.",
    "music_version": "The version of the music track (e.g. radio edit, extended mix, etc.).",
    "music_year": "The year that the music track was released.",
    "picture_camera_make": "The make of the camera used to take the picture.",
    "picture_camera_model": "The model of the camera used to take the picture.",
    "picture_credit": "The credit or attribution for the picture (e.g. \"Photo by John Smith\").",
    "picture_date_taken": "The date the picture was taken.",
    "picture_image_format": "The file format of the picture (e.g. JPEG, PNG, etc.).",
    "picture_image_resolution": "The resolution of the picture (in pixels).",
    "picture_image_size": "The file size of the picture (in bytes).",
    "picture_location_taken": "The location where the picture was taken.",
    "picture_photographer_name": "The name of the photographer who took the picture.",
    "video_aspect_ratio": "The aspect ratio of the video (e.g. 16)",
    "video_captions": "A list of languages available for closed captions.",
    "video_cast": "A list of actors or performers who appear in the video.",
    "video_director": "The name of the director who created the video.",
    "video_duration": "The duration of the video (in seconds or minutes).",
    "video_frame_rate": "The frame rate of the video (in frames per second).",
    "video_resolution": "The resolution of the video (in pixels).",
    "video_subtitles": "A list of languages available for subtitles.",
    "video_tv_total_seasons": "How many seasons are there (if applicable)?"
}
